import apple from "../images/product-images/apple.png";
import bannana from "../images/product-images/bannana.png";
import orange from "../images/product-images/orange.png";
import bagdons from "../images/product-images/bagdons.png";
import fjl from "../images/product-images/fjl.png";
import ananas from "../images/product-images/ananas.png";
import botato from "../images/product-images/botato.png";
import carrot from "../images/product-images/carrot.png";
import kazbara from "../images/product-images/kazbara.png";
import folfol from "../images/product-images/folfol.png";
import khs from "../images/product-images/khs.png";
import onion from "../images/product-images/onion.png";
import tomato from "../images/product-images/tomato.png";
import shabat from "../images/product-images/shabat.png";
import mango from "../images/product-images/mango.png";
import farawla from "../images/product-images/farawla.png";
import bathnjan from "../images/product-images/bathnjan.png";
import malfof from "../images/product-images/malfof.png";
import mint from "../images/product-images/mint.png";
import wonion from "../images/product-images/white-onion.png";

const data = [
  {
    id: 1,
    name: "تفاح",
    price: 9.99,
    image: apple,
    category: "fruits",
    contain: "كرتون 1 كيلو",
    origin: "تهامة",
    quantity: 1,
    recipe: {
      name: "تفاح بالزبدة والقرفة",
      ingredients: [
        "تفاحات متوسطة مقشرة ومقطعة إلى شرائح رقيقة",
        "2 ملعقة كبيرة من الزبدة",
        "2 ملعقة صغيرة من القرفة",
        " (اختياري)2 ملعقة كبيرة من السكر البني",
        "عسل نحل للتزيين (اختياري)",
      ],
      steps:
        "في مقلاة كبيرة، قومي تذويب الزبدة على نار متوسطة ثم رشي القرفة على شرائح التفاح وقلبيها مرة أخرى لضمان توزيعها بالتساوي  رشي القرفة على شرائح التفاح وقلبيها مرة أخرى لضمان توزيعها بالتساوي, قلبي شرائح , التفاح بين الحين والآخر واتركيها تطهى لمدة 5-7 دقائق حتى تصبح طرية وذهبية اللون, قدمي التفاح بالزبدة والقرفة ساخنًا، وإذا رغبتِ يمكنك إضافة قليل من العسل النحل للتزيين على الوجه",
    },
  },
  {
    id: 2,
    name: "موز",
    price: 5.99,
    image: bannana,
    category: "fruits",
    contain: "كرتون 1 كيلو",
    origin: "السودان",
    quantity: 1,
    recipe: {
      name: "موز بالشوكولاتة",
      ingredients: ["موزة مقطعة إلى شرائح", "شوكولاتة داكنة مذابة"],
      steps:
        "قم بتقطيع الموز إلى شرائح. اذوب شوكولاتة داكنة في الميكروويف أو على حمام مائي. غمس شرائح الموز في الشوكولاتة. ثم ضعها على صينية مغلفة بورق زبدة. ثم قم بتبريدها في الثلاجة حتى تتماسك الشوكولاتة. قدم الموز بالشوكولاتة كوجبة حلوة لذيذة.      ",
    },
  },
  {
    id: 3,
    name: "برتقال",
    price: 8.99,
    image: orange,
    category: "fruits",
    contain: "كرتون 1 كيلو",
    origin: "مصر",
    quantity: 1,
    recipe: {
      name: "عصير برتقال",
      ingredients: [
        "برتقالة مقشرة ومقطعة إلى شرائح",
        "ملعقة كبيرة من السكر",
        "كوب ماء بارد",
      ],
      steps: "ضعي جميع المكونات في الخلاط واخلطيها جيدًا. قدميها باردة.",
    },
  },
  {
    id: 4,
    name: "باذنجان",
    price: 7.99,
    image: bathnjan,
    category: "vegetables",
    contain: "كرتون 1 كيلو",
    origin: "تهامة",
    quantity: 1,
    recipe: {
      name: "مسقعة",
      ingredients: [
        "باذنجان مقطع إلى مكعبات",
        "بصلة مقطعة إلى مكعبات",
        "فلفل أخضر مقطع إلى مكعبات",
        "فلفل أحمر مقطع إلى مكعبات",
        "طماطم مقطعة إلى مكعبات",
        "ملعقة كبيرة من الطحينة",
      ],
      steps:
        "قومي بقلي الباذنجان في زيت غزير حتى يصبح ذهبي اللون. ثم قومي بتقليبه مع البصل والفلفل الأخضر والفلفل الأحمر والطماطم. ثم أضيفي الملح والفلفل الأسود والطحينة والماء. ثم قدميها ساخنة.",
    },
  },
  {
    id: 5,
    name: "بطاطا",
    price: 5.99,
    image: botato,
    category: "vegetables",
    contain: "كيس 1 كيلو",
    origin: "الطائف",
    quantity: 1,
    recipe: {
      name: "بطاطا مقلية",
      ingredients: ["بطاطا مقطعة إلى شرائح", "زيت غزير"],
      steps: "قومي بقلي البطاطا في زيت غزير حتى تصبح ذهبية اللون.",
    },
  },
  {
    id: 6,
    name: "جزر",
    price: 7.99,
    image: carrot,
    category: "vegetables",
    contain: "كرتون 1 كيلو",
    origin: "الطائف",
    quantity: 1,
    recipe: {
      name: "سلطة جزر",
      ingredients: [
        "جزر مقطع إلى شرائح",
        "ملعقة كبيرة من الخل",
        "ملعقة كبيرة من الزيت",
        "ملعقة صغيرة من السكر",
        "ملعقة صغيرة من الملح",
      ],
      steps:
        "قشِّر واستخدم مبشرة لتجهيز الجزر المبشورة. اخلطها مع زيت الزيتون وعصير ليمون وزعته قليلاً من العسل. أضف ملح وفلفل حسب الذوق. قدِّم سلطة الجزر باردة مزينة بأوراق البقدونس.",
    },
  },
  {
    id: 7,
    name: "فلفل",
    price: 10.99,
    image: folfol,
    category: "vegetables",
    contain: "كرتون 1 كيلو",
    origin: "الطائف",
    quantity: 1,
    recipe: {
      name: "فلفل محشي",
      ingredients: [
        "فلفل مقطع إلى شرائح",
        "بصلة مقطعة إلى شرائح",
        "طماطم مقطعة إلى شرائح",
        "لحم مفروم",
        "أرز",
      ],
      steps:
        "قومي بقلي البصل واللحم المفروم في زيت غزير حتى يصبح ذهبي اللون. ثم قومي بتقليبه مع الأرز والملح والفلفل الأسود والطماطم. ثم املئي الفلفل بالخليط وضعيه في صينية واحدة. ثم ضعيه في الفرن لمدة 30 دقيقة. ثم قدميها ساخنة.",
    },
  },
  {
    id: 8,
    name: "فجل",
    price: 16.99,
    image: fjl,
    category: "vegetables",
    contain: "كرتون 1 كيلو",
    origin: "الطائف",
    quantity: 1,
    recipe: {
      name: "سلطة فجل",
      ingredients: [
        "فجل مقطع إلى شرائح",
        "ملعقة كبيرة من الخل",
        "ملعقة كبيرة من الزيت",
        "ملعقة صغيرة من السكر",
        "ملعقة صغيرة من الملح",
      ],
      steps:
        "قشِّر واستخدم مبشرة لتجهيز الفجل المبشور. اخلطها مع زيت الزيتون وعصير ليمون وزعته قليلاً من العسل. أضف ملح وفلفل حسب الذوق. قدِّم سلطة الفجل باردة مزينة بأوراق البقدونس.",
    },
  },
  {
    id: 9,
    name: "كزبرة",
    price: 0.99,
    image: kazbara,
    category: "plants",
    contain: "ربطة 0,2 جرام",
    origin: "الرياض",
    quantity: 1,
    recipe: {
      name: "سلطة كزبرة",
      ingredients: [
        "كزبرة مقطعة إلى شرائح",
        "ملعقة كبيرة من الخل",
        "ملعقة كبيرة من الزيت",
        "ملعقة صغيرة من السكر",
        "ملعقة صغيرة من الملح",
      ],
      steps:
        "قشِّر واستخدم مبشرة لتجهيز الكزبرة المبشور. اخلطها مع زيت الزيتون وعصير ليمون وزعته قليلاً من العسل. أضف ملح وفلفل حسب الذوق. قدِّم سلطة الكزبرة باردة مزينة بأوراق البقدونس.",
    },
  },
  {
    id: 10,
    name: "خس",
    price: 1.99,
    image: khs,
    category: "plants",
    contain: "ربطة 0,4 جرام",
    origin: "الرياض",
    quantity: 1,
    recipe: {
      name: "سلطة خس",
      ingredients: [
        "خس مقطع إلى شرائح",
        "ملعقة كبيرة من الخل",
        "ملعقة كبيرة من الزيت",
        "ملعقة صغيرة من السكر",
        "ملعقة صغيرة من الملح",
      ],
      steps:
        "قشِّر واستخدم مبشرة لتجهيز الخس المبشور. اخلطها مع زيت الزيتون وعصير ليمون وزعته قليلاً من العسل. أضف ملح وفلفل حسب الذوق. قدِّم سلطة الخس باردة مزينة بأوراق البقدونس.",
    },
  },
  {
    id: 11,
    name: "بصل",
    price: 6.99,
    image: onion,
    category: "vegetables",
    contain: "كرتون 1 كيلو",
    origin: "مكة",
    quantity: 1,
    recipe: {
      name: "البصل المخمر",
      ingredients: ["بصل مقطع إلى شرائح", "زيت غزير"],
      steps:
        "سخن مقلاة مع زيت زيتون على نار متوسطة. أضف البصل وقلبه بين الحين والآخر حتى يصبح ذهبي اللون ومخمرًا. ثم قدمه كمكمل للسلطات أو الوجبات. تحضيره سيمنحك نكهة غنية ولذيذة.",
    },
  },
  {
    id: 12,
    name: "طماطم",
    price: 9.99,
    image: tomato,
    category: "vegetables",
    contain: "كرتون 1 كيلو",
    origin: "تهامة",
    quantity: 1,
    recipe: {
      name: "سلطة طماطم بالدكوة",
      ingredients: [
        "طماطم مقطعة إلى شرائح",
        "ملعقة كبيرة من الخل",
        "ملعقة كبيرة من الزيت",
        "ملعقة صغيرة من الملح",
      ],
      steps:
        "لتحضير سلطة الطماطم بزبدة الفول السوداني، قطعي الطماطم وزينيها بزبدة الفول السوداني وعسل نحل وعصير ليمون ورشة ملح، ثم اخلطي المكونات وزيّني بالنعناع أو البقدونس.",
    },
  },
  {
    id: 13,
    name: "شبت",
    price: 0.99,
    image: shabat,
    category: "plants",
    origin: "الباحة",
    quantity: 1,
    recipe: {
      name: "سلطة شبت",
      ingredients: [
        "شبت مقطع إلى شرائح",
        "ملعقة كبيرة من الخل",
        "ملعقة كبيرة من الزيت",
        "ملعقة صغيرة من السكر",
      ],
      steps:
        "لتحضير سلطة الشبت، قطعي الطماطم والخيار إلى مكعبات. امزجيهم مع الزبادي وزيت الزيتون وثوم مفروم وشبت طازج مفروم. قدّمي السلطة باردة مع رشة ملح وفلفل أسود. يمكنك إضافة عصير ليمون لتعزيز النكهة. تُعتبر هذه السلطة منعشة ومثالية كمقبل أو جانب .",
    },
  },
  {
    id: 14,
    name: "مانجو",
    price: 28.99,
    image: mango,
    category: "fruits",
    contain: "كرتون 1 كيلو",
    origin: "الطائف",
    quantity: 1,
    recipe: {
      name: "مانجو بالكريمة",
      ingredients: ["مانجو مقطع إلى شرائح", "كريمة طازجة", "سكر", "فانيليا"],
      steps:
        "قومي بتقطيع المانجو إلى شرائح. اخلطي الكريمة مع السكر والفانيليا. ثم ضعي الكريمة على الشرائح. ثم قدميها باردة.",
    },
  },
  {
    id: 15,
    name: "فراولة",
    price: 24.99,
    image: farawla,
    category: "fruits",
    contain: "كرتون 0.5 كيلو",
    origin: "امريكا",
    quantity: 1,
    recipe: {
      name: "فراولة بالحليب",
      ingredients: ["فراولة مقطعة إلى شرائح", "حليب", "سكر", "فانيليا"],
      steps:
        "قومي بتقطيع الفراولة إلى شرائح. اخلطي الحليب مع السكر والفانيليا. ثم ضعي الحليب على الشرائح. ثم قدميها باردة.",
    },
  },
  {
    id: 16,
    name: "ملفوف",
    price: 8.99,
    image: malfof,
    category: "vegetables",
    contain: "حبة 0.6 كيلو",
    origin: "تهامة",
    quantity: 1,
    recipe: {
      name: "ملفوف محشي",
      ingredients: [
        "ملفوف مقطع إلى شرائح",
        "بصلة مقطعة إلى شرائح",
        "طماطم مقطعة إلى شرائح",
        "لحم مفروم",
        "أرز",
      ],
      steps:
        "قومي بقلي البصل واللحم المفروم في زيت غزير حتى يصبح ذهبي اللون. ثم قومي بتقليبه مع الأرز والملح والفلفل الأسود والطماطم. ثم املئي الملفوف بالخليط وضعيه في صينية واحدة. ثم ضعيه في الفرن لمدة 30 دقيقة. ثم قدميها ساخنة.",
    },
  },
  {
    id: 17,
    name: "نعناع",
    price: 1,
    image: mint,
    category: "vegetables",
    contain: "ربطة 0.2 جرام",
    origin: "المدينةالمنورة",
    quantity: 1,
    recipe: {
      name: "شاي بالنعاع",
      ingredients: ["نعناع مقطع إلى شرائح", "ماء", "سكر", "شاي أسود"],
      steps:
        "قومي بتقطيع النعناع إلى شرائح. اخلطي الشاي مع السكر والنعناع. ثم ضعي الشاي على الشرائح..",
    },
  },
  {
    id: 18,
    name: "بصل ابيض",
    price: 9.99,
    image: wonion,
    category: "vegetables",
    contain: "كيس 1 كيلو",
    origin: "الطائف",
    quantity: 1,
    recipe: {
      name: "البصل المخمر",
      ingredients: ["بصل مقطع إلى شرائح", "زيت غزير"],
      steps:
        "سخن مقلاة مع زيت زيتون على نار متوسطة. أضف البصل وقلبه بين الحين والآخر حتى يصبح ذهبي اللون ومخمرًا. ثم قدمه كمكمل للسلطات أو الوجبات. تحضيره سيمنحك نكهة غنية ولذيذة.",
    },
  },
  {
    id: 19,
    name: "اناناس",
    price: 12.99,
    image: ananas,
    category: "fruits",
    contain: "حبة 0.8 كيلو",
    origin: "القصيم",
    quantity: 1,
    recipe: {
      name: "اناناس بالكريمة",
      ingredients: ["اناناس مقطع إلى شرائح", "كريمة طازجة", "سكر", "فانيليا"],
      steps:
        "قومي بتقطيع الاناناس إلى شرائح. اخلطي الكريمة مع السكر والفانيليا. ثم ضعي الكريمة على الشرائح. ثم قدميها باردة.",
    },
  },
  {
    id: 20,
    name: "باجدونس",
    price: 1.99,
    image: bagdons,
    category: "plants",
    contain: "ربطة 0.2 جرام",
    origin: "تهامة",
    quantity: 1,
    recipe: {
      name: "سلطة باجدونس",
      ingredients: [
        "باجدونس مقطع إلى شرائح",
        "ملعقة كبيرة من الخل",
        "ملعقة كبيرة من الزيت",
        "ملعقة صغيرة من السكر",
      ],
      steps:
        "لتحضير سلطة البقدونس، قطعي الطماطم والخيار إلى مكعبات. امزجيهم مع الزبادي وزيت الزيتون وثوم مفروم وبقدونس طازج مفروم. قدّمي السلطة باردة مع رشة ملح وفلفل أسود. يمكنك إضافة عصير ليمون لتعزيز النكهة. تُعتبر هذه السلطة منعشة ومثالية كمقبل أو جانب .",
    },
  },
];
export default data;
